; domain
(define (domain kitchen-line)
  (:requirements :strips :typing)
  (:types chef recipe utensil garnish)
  (:predicates
  (carries ?i - utensil ?s - chef)
  (prepares ?i - utensil ?m - garnish)
  (focused_on ?s - chef ?d - recipe)
  (energy_spare ?s - chef)
  (energy_active ?i - utensil)
  (sharpened ?i - utensil)
  (have_dish ?d - recipe ?m - garnish)
  (sharpening_recipe ?i - utensil ?d - recipe))

  (:action switch_focus
   :parameters (?s - chef ?d_new - recipe ?d_prev - recipe)
   :precondition (and (focused_on ?s ?d_prev))
   :effect (and  (focused_on ?s ?d_new)
                 (not (focused_on ?s ?d_prev))))

  (:action fire_up
   :parameters (?i - utensil ?s - chef)
   :precondition (and (carries ?i ?s)
                      (energy_spare ?s))
   :effect (and (energy_active ?i)
                (not (sharpened ?i))
                (not (energy_spare ?s))))

  (:action cool_down
   :parameters (?i - utensil ?s - chef)
   :precondition (and (carries ?i ?s)
                      (energy_active ?i))
   :effect (and (not (energy_active ?i))
                (energy_spare ?s)))

  (:action sharpen
   :parameters (?s - chef ?i - utensil ?d - recipe)
   :precondition (and (carries ?i ?s)
          (sharpening_recipe ?i ?d)
                      (focused_on ?s ?d)
                      (energy_active ?i))
   :effect (sharpened ?i))

  (:action plate_dish
   :parameters (?s - chef ?d - recipe ?i - utensil ?m - garnish)
   :precondition (and (sharpened ?i)
                      (carries ?i ?s)
                      (prepares ?i ?m)
                      (energy_active ?i)
                      (focused_on ?s ?d))
   :effect (have_dish ?d ?m)))

; problem
(define (problem kitchen-line-p05)
(:domain kitchen-line)
(:objects
	chef0 - chef
	utensil0 - utensil
	utensil1 - utensil
	utensil2 - utensil
	chef1 - chef
	utensil3 - utensil
	utensil4 - utensil
	utensil5 - utensil
	chef2 - chef
	utensil6 - utensil
	utensil7 - utensil
	utensil8 - utensil
	plating1 - garnish
	griddle0 - garnish
	entree2 - recipe
	pantry0 - recipe
	entree1 - recipe
	dessert3 - recipe
	dessert4 - recipe
	dessert5 - recipe
	appetiser6 - recipe
)
(:init
	(prepares utensil0 plating1)
	(prepares utensil0 griddle0)
	(sharpening_recipe utensil0 entree1)
	(prepares utensil1 griddle0)
	(prepares utensil1 plating1)
	(sharpening_recipe utensil1 entree2)
	(prepares utensil2 griddle0)
	(prepares utensil2 plating1)
	(sharpening_recipe utensil2 entree1)
	(carries utensil0 chef0)
	(carries utensil1 chef0)
	(carries utensil2 chef0)
	(energy_spare chef0)
	(focused_on chef0 entree1)
	(prepares utensil3 plating1)
	(prepares utensil3 griddle0)
	(sharpening_recipe utensil3 entree2)
	(prepares utensil4 plating1)
	(sharpening_recipe utensil4 entree1)
	(prepares utensil5 griddle0)
	(sharpening_recipe utensil5 entree2)
	(carries utensil3 chef1)
	(carries utensil4 chef1)
	(carries utensil5 chef1)
	(energy_spare chef1)
	(focused_on chef1 entree1)
	(prepares utensil6 plating1)
	(prepares utensil6 griddle0)
	(sharpening_recipe utensil6 pantry0)
	(prepares utensil7 griddle0)
	(prepares utensil7 plating1)
	(sharpening_recipe utensil7 entree1)
	(prepares utensil8 griddle0)
	(sharpening_recipe utensil8 entree1)
	(carries utensil6 chef2)
	(carries utensil7 chef2)
	(carries utensil8 chef2)
	(energy_spare chef2)
	(focused_on chef2 dessert3)
)
(:goal (and
	(have_dish dessert3 griddle0)
	(have_dish dessert4 griddle0)
	(have_dish dessert5 griddle0)
	(have_dish appetiser6 griddle0)
))

)

; plan
1. (fire_up utensil6 chef2)
   deleted: (energy_spare chef2)
   added: (energy_active utensil6)
   goals met: 0 of 4
2. (switch_focus chef2 pantry0 dessert3)
   deleted: (focused_on chef2 dessert3)
   added: (focused_on chef2 pantry0)
   goals met: 0 of 4
3. (sharpen chef2 utensil6 pantry0)
   added: (sharpened utensil6)
   goals met: 0 of 4
4. (switch_focus chef2 appetiser6 pantry0)
   deleted: (focused_on chef2 pantry0)
   added: (focused_on chef2 appetiser6)
   goals met: 0 of 4
5. (plate_dish chef2 appetiser6 utensil6 griddle0)
   added: (have_dish appetiser6 griddle0)
   goals met: 1 of 4
6. (switch_focus chef2 dessert3 appetiser6)
   deleted: (focused_on chef2 appetiser6)
   added: (focused_on chef2 dessert3)
   goals met: 1 of 4
7. (plate_dish chef2 dessert3 utensil6 griddle0)
   added: (have_dish dessert3 griddle0)
   goals met: 2 of 4
8. (switch_focus chef2 dessert4 dessert3)
   deleted: (focused_on chef2 dessert3)
   added: (focused_on chef2 dessert4)
   goals met: 2 of 4
9. (plate_dish chef2 dessert4 utensil6 griddle0)
   added: (have_dish dessert4 griddle0)
   goals met: 3 of 4
10. (switch_focus chef2 dessert5 dessert4)
   deleted: (focused_on chef2 dessert4)
   added: (focused_on chef2 dessert5)
   goals met: 3 of 4
11. (plate_dish chef2 dessert5 utensil6 griddle0)
   added: (have_dish dessert5 griddle0)
   goals met: 4 of 4
